GopalSaraf/Practicals/PSDL/include/proc/pic16f18076.inc
// Register: RC5PPS
#define RC5PPS RC5PPS
RC5PPS                                   equ 01DA1h
// bitfield definitions
RC5PPS_RC5PPS_POSN                       equ 0000h
RC5PPS_RC5PPS_POSITION                   equ 0000h
RC5PPS_RC5PPS_SIZE                       equ 0005h
RC5PPS_RC5PPS_LENGTH                     equ 0005h
RC5PPS_RC5PPS_MASK                       equ 001Fh

// Register: RC6PPS
#define RC6PPS RC6PPS
RC6PPS                                   equ 01DA2h
// bitfield definitions
RC6PPS_RC6PPS_POSN                       equ 0000h
RC6PPS_RC6PPS_POSITION                   equ 0000h
RC6PPS_RC6PPS_SIZE                       equ 0005h
RC6PPS_RC6PPS_LENGTH                     equ 0005h
RC6PPS_RC6PPS_MASK                       equ 001Fh

// Register: RC7PPS
#define RC7PPS RC7PPS
RC7PPS                                   equ 01DA3h
// bitfield definitions
RC7PPS_RC7PPS_POSN                       equ 0000h
RC7PPS_RC7PPS_POSITION                   equ 0000h
RC7PPS_RC7PPS_SIZE                       equ 0005h
RC7PPS_RC7PPS_LENGTH                     equ 0005h
RC7PPS_RC7PPS_MASK                       equ 001Fh

// Register: RD0PPS
#define RD0PPS RD0PPS
RD0PPS                                   equ 01DA4h
// bitfield definitions
RD0PPS_RD0PPS_POSN                       equ 0000h
RD0PPS_RD0PPS_POSITION                   equ 0000h
RD0PPS_RD0PPS_SIZE                       equ 0005h
RD0PPS_RD0PPS_LENGTH                     equ 0005h
RD0PPS_RD0PPS_MASK                       equ 001Fh

// Register: RD1PPS
#define RD1PPS RD1PPS
RD1PPS                                   equ 01DA5h
// bitfield definitions
RD1PPS_RD1PPS_POSN                       equ 0000h
RD1PPS_RD1PPS_POSITION                   equ 0000h
RD1PPS_RD1PPS_SIZE                       equ 0005h
RD1PPS_RD1PPS_LENGTH                     equ 0005h
RD1PPS_RD1PPS_MASK                       equ 001Fh

// Register: RD2PPS
#define RD2PPS RD2PPS
RD2PPS                                   equ 01DA6h
// bitfield definitions
RD2PPS_RD2PPS_POSN                       equ 0000h
RD2PPS_RD2PPS_POSITION                   equ 0000h
RD2PPS_RD2PPS_SIZE                       equ 0005h
RD2PPS_RD2PPS_LENGTH                     equ 0005h
RD2PPS_RD2PPS_MASK                       equ 001Fh

// Register: RD3PPS
#define RD3PPS RD3PPS
RD3PPS                                   equ 01DA7h
// bitfield definitions
RD3PPS_RD3PPS_POSN                       equ 0000h
RD3PPS_RD3PPS_POSITION                   equ 0000h
RD3PPS_RD3PPS_SIZE                       equ 0005h
RD3PPS_RD3PPS_LENGTH                     equ 0005h
RD3PPS_RD3PPS_MASK                       equ 001Fh

// Register: RD4PPS
#define RD4PPS RD4PPS
RD4PPS                                   equ 01DA8h
// bitfield definitions
RD4PPS_RD4PPS_POSN                       equ 0000h
RD4PPS_RD4PPS_POSITION                   equ 0000h
RD4PPS_RD4PPS_SIZE                       equ 0005h
RD4PPS_RD4PPS_LENGTH                     equ 0005h
RD4PPS_RD4PPS_MASK                       equ 001Fh

// Register: RD5PPS
#define RD5PPS RD5PPS
RD5PPS                                   equ 01DA9h
// bitfield definitions
RD5PPS_RD5PPS_POSN                       equ 0000h
RD5PPS_RD5PPS_POSITION                   equ 0000h
RD5PPS_RD5PPS_SIZE                       equ 0005h
RD5PPS_RD5PPS_LENGTH                     equ 0005h
RD5PPS_RD5PPS_MASK                       equ 001Fh

// Register: RD6PPS
#define RD6PPS RD6PPS
RD6PPS                                   equ 01DAAh
// bitfield definitions
RD6PPS_RD6PPS_POSN                       equ 0000h
RD6PPS_RD6PPS_POSITION                   equ 0000h
RD6PPS_RD6PPS_SIZE                       equ 0005h
RD6PPS_RD6PPS_LENGTH                     equ 0005h
RD6PPS_RD6PPS_MASK                       equ 001Fh

// Register: RD7PPS
#define RD7PPS RD7PPS
RD7PPS                                   equ 01DABh
// bitfield definitions
RD7PPS_RD7PPS_POSN                       equ 0000h
RD7PPS_RD7PPS_POSITION                   equ 0000h
RD7PPS_RD7PPS_SIZE                       equ 0005h
RD7PPS_RD7PPS_LENGTH                     equ 0005h
RD7PPS_RD7PPS_MASK                       equ 001Fh

// Register: RE0PPS
#define RE0PPS RE0PPS
RE0PPS                                   equ 01DACh
// bitfield definitions
RE0PPS_RE0PPS_POSN                       equ 0000h
RE0PPS_RE0PPS_POSITION                   equ 0000h
RE0PPS_RE0PPS_SIZE                       equ 0005h
RE0PPS_RE0PPS_LENGTH                     equ 0005h
RE0PPS_RE0PPS_MASK                       equ 001Fh

// Register: RE1PPS
#define RE1PPS RE1PPS
RE1PPS                                   equ 01DADh
// bitfield definitions
RE1PPS_RE1PPS_POSN                       equ 0000h
RE1PPS_RE1PPS_POSITION                   equ 0000h
RE1PPS_RE1PPS_SIZE                       equ 0005h
RE1PPS_RE1PPS_LENGTH                     equ 0005h
RE1PPS_RE1PPS_MASK                       equ 001Fh

// Register: RE2PPS
#define RE2PPS RE2PPS
RE2PPS                                   equ 01DAEh
// bitfield definitions
RE2PPS_RE2PPS_POSN                       equ 0000h
RE2PPS_RE2PPS_POSITION                   equ 0000h
RE2PPS_RE2PPS_SIZE                       equ 0005h
RE2PPS_RE2PPS_LENGTH                     equ 0005h
RE2PPS_RE2PPS_MASK                       equ 001Fh

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 01E0Ch
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 01E0Dh
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0006h
INTPPS_INTPPS_LENGTH                     equ 0006h
INTPPS_INTPPS_MASK                       equ 003Fh
INTPPS_INTPPS0_POSN                      equ 0000h
INTPPS_INTPPS0_POSITION                  equ 0000h
INTPPS_INTPPS0_SIZE                      equ 0001h
INTPPS_INTPPS0_LENGTH                    equ 0001h
INTPPS_INTPPS0_MASK                      equ 0001h
INTPPS_INTPPS1_POSN                      equ 0001h
INTPPS_INTPPS1_POSITION                  equ 0001h
INTPPS_INTPPS1_SIZE                      equ 0001h
INTPPS_INTPPS1_LENGTH                    equ 0001h
INTPPS_INTPPS1_MASK                      equ 0002h
INTPPS_INTPPS2_POSN                      equ 0002h
INTPPS_INTPPS2_POSITION                  equ 0002h
INTPPS_INTPPS2_SIZE                      equ 0001h
INTPPS_INTPPS2_LENGTH                    equ 0001h
INTPPS_INTPPS2_MASK                      equ 0004h
INTPPS_INTPPS3_POSN                      equ 0003h
INTPPS_INTPPS3_POSITION                  equ 0003h
INTPPS_INTPPS3_SIZE                      equ 0001h
INTPPS_INTPPS3_LENGTH                    equ 0001h
INTPPS_INTPPS3_MASK                      equ 0008h
INTPPS_INTPPS4_POSN                      equ 0004h
INTPPS_INTPPS4_POSITION                  equ 0004h
INTPPS_INTPPS4_SIZE                      equ 0001h
INTPPS_INTPPS4_LENGTH                    equ 0001h
INTPPS_INTPPS4_MASK                      equ 0010h
INTPPS_INTPPS5_POSN                      equ 0005h
INTPPS_INTPPS5_POSITION                  equ 0005h
INTPPS_INTPPS5_SIZE                      equ 0001h
INTPPS_INTPPS5_LENGTH                    equ 0001h
INTPPS_INTPPS5_MASK                      equ 0020h

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 01E0Eh
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0006h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0006h
T0CKIPPS_T0CKIPPS_MASK                   equ 003Fh
T0CKIPPS_T0CKIPPS0_POSN                  equ 0000h
T0CKIPPS_T0CKIPPS0_POSITION              equ 0000h
T0CKIPPS_T0CKIPPS0_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS0_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS0_MASK                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSN                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSITION              equ 0001h
T0CKIPPS_T0CKIPPS1_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS1_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS1_MASK                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSN                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSITION              equ 0002h
T0CKIPPS_T0CKIPPS2_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS2_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS2_MASK                  equ 0004h
T0CKIPPS_T0CKIPPS3_POSN                  equ 0003h
T0CKIPPS_T0CKIPPS3_POSITION              equ 0003h
T0CKIPPS_T0CKIPPS3_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS3_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS3_MASK                  equ 0008h
T0CKIPPS_T0CKIPPS4_POSN                  equ 0004h
T0CKIPPS_T0CKIPPS4_POSITION              equ 0004h
T0CKIPPS_T0CKIPPS4_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS4_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS4_MASK                  equ 0010h
T0CKIPPS_T0CKIPPS5_POSN                  equ 0005h
T0CKIPPS_T0CKIPPS5_POSITION              equ 0005h
T0CKIPPS_T0CKIPPS5_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS5_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS5_MASK                  equ 0020h

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 01E0Fh
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0006h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0006h
T1CKIPPS_T1CKIPPS_MASK                   equ 003Fh
T1CKIPPS_T1CKIPPS0_POSN                  equ 0000h
T1CKIPPS_T1CKIPPS0_POSITION              equ 0000h
T1CKIPPS_T1CKIPPS0_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS0_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS0_MASK                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSN                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSITION              equ 0001h
T1CKIPPS_T1CKIPPS1_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS1_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS1_MASK                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSN                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSITION              equ 0002h
T1CKIPPS_T1CKIPPS2_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS2_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS2_MASK                  equ 0004h
T1CKIPPS_T1CKIPPS3_POSN                  equ 0003h
T1CKIPPS_T1CKIPPS3_POSITION              equ 0003h
T1CKIPPS_T1CKIPPS3_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS3_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS3_MASK                  equ 0008h
T1CKIPPS_T1CKIPPS4_POSN                  equ 0004h
T1CKIPPS_T1CKIPPS4_POSITION              equ 0004h
T1CKIPPS_T1CKIPPS4_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS4_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS4_MASK                  equ 0010h
T1CKIPPS_T1CKIPPS5_POSN                  equ 0005h
T1CKIPPS_T1CKIPPS5_POSITION              equ 0005h
T1CKIPPS_T1CKIPPS5_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS5_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS5_MASK                  equ 0020h

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 01E10h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0006h
T1GPPS_T1GPPS_LENGTH                     equ 0006h
T1GPPS_T1GPPS_MASK                       equ 003Fh
T1GPPS_T1GPPS0_POSN                      equ 0000h
T1GPPS_T1GPPS0_POSITION                  equ 0000h
T1GPPS_T1GPPS0_SIZE                      equ 0001h
T1GPPS_T1GPPS0_LENGTH                    equ 0001h
T1GPPS_T1GPPS0_MASK                      equ 0001h
T1GPPS_T1GPPS1_POSN                      equ 0001h
T1GPPS_T1GPPS1_POSITION                  equ 0001h
T1GPPS_T1GPPS1_SIZE                      equ 0001h
T1GPPS_T1GPPS1_LENGTH                    equ 0001h
T1GPPS_T1GPPS1_MASK                      equ 0002h
T1GPPS_T1GPPS2_POSN                      equ 0002h
T1GPPS_T1GPPS2_POSITION                  equ 0002h
T1GPPS_T1GPPS2_SIZE                      equ 0001h
T1GPPS_T1GPPS2_LENGTH                    equ 0001h
T1GPPS_T1GPPS2_MASK                      equ 0004h
T1GPPS_T1GPPS3_POSN                      equ 0003h
T1GPPS_T1GPPS3_POSITION                  equ 0003h
T1GPPS_T1GPPS3_SIZE                      equ 0001h
T1GPPS_T1GPPS3_LENGTH                    equ 0001h
T1GPPS_T1GPPS3_MASK                      equ 0008h
T1GPPS_T1GPPS4_POSN                      equ 0004h
T1GPPS_T1GPPS4_POSITION                  equ 0004h
T1GPPS_T1GPPS4_SIZE                      equ 0001h
T1GPPS_T1GPPS4_LENGTH                    equ 0001h
T1GPPS_T1GPPS4_MASK                      equ 0010h
T1GPPS_T1GPPS5_POSN                      equ 0005h
T1GPPS_T1GPPS5_POSITION                  equ 0005h
T1GPPS_T1GPPS5_SIZE                      equ 0001h
T1GPPS_T1GPPS5_LENGTH                    equ 0001h
T1GPPS_T1GPPS5_MASK                      equ 0020h

