GopalSaraf/Practicals/PSDL/include/proc/pic16f18076.inc
// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 01EBBh
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: RB1I2C
#define RB1I2C RB1I2C
RB1I2C                                   equ 01EE3h
// bitfield definitions
RB1I2C_TH_POSN                           equ 0000h
RB1I2C_TH_POSITION                       equ 0000h
RB1I2C_TH_SIZE                           equ 0002h
RB1I2C_TH_LENGTH                         equ 0002h
RB1I2C_TH_MASK                           equ 0003h
RB1I2C_PU_POSN                           equ 0004h
RB1I2C_PU_POSITION                       equ 0004h
RB1I2C_PU_SIZE                           equ 0002h
RB1I2C_PU_LENGTH                         equ 0002h
RB1I2C_PU_MASK                           equ 0030h
RB1I2C_SLEW_POSN                         equ 0006h
RB1I2C_SLEW_POSITION                     equ 0006h
RB1I2C_SLEW_SIZE                         equ 0002h
RB1I2C_SLEW_LENGTH                       equ 0002h
RB1I2C_SLEW_MASK                         equ 00C0h

// Register: RB2I2C
#define RB2I2C RB2I2C
RB2I2C                                   equ 01EE4h
// bitfield definitions
RB2I2C_TH_POSN                           equ 0000h
RB2I2C_TH_POSITION                       equ 0000h
RB2I2C_TH_SIZE                           equ 0002h
RB2I2C_TH_LENGTH                         equ 0002h
RB2I2C_TH_MASK                           equ 0003h
RB2I2C_PU_POSN                           equ 0004h
RB2I2C_PU_POSITION                       equ 0004h
RB2I2C_PU_SIZE                           equ 0002h
RB2I2C_PU_LENGTH                         equ 0002h
RB2I2C_PU_MASK                           equ 0030h
RB2I2C_SLEW_POSN                         equ 0006h
RB2I2C_SLEW_POSITION                     equ 0006h
RB2I2C_SLEW_SIZE                         equ 0002h
RB2I2C_SLEW_LENGTH                       equ 0002h
RB2I2C_SLEW_MASK                         equ 00C0h

// Register: RC3I2C
#define RC3I2C RC3I2C
RC3I2C                                   equ 01EEBh
// bitfield definitions
RC3I2C_TH_POSN                           equ 0000h
RC3I2C_TH_POSITION                       equ 0000h
RC3I2C_TH_SIZE                           equ 0002h
RC3I2C_TH_LENGTH                         equ 0002h
RC3I2C_TH_MASK                           equ 0003h
RC3I2C_PU_POSN                           equ 0004h
RC3I2C_PU_POSITION                       equ 0004h
RC3I2C_PU_SIZE                           equ 0002h
RC3I2C_PU_LENGTH                         equ 0002h
RC3I2C_PU_MASK                           equ 0030h
RC3I2C_SLEW_POSN                         equ 0006h
RC3I2C_SLEW_POSITION                     equ 0006h
RC3I2C_SLEW_SIZE                         equ 0002h
RC3I2C_SLEW_LENGTH                       equ 0002h
RC3I2C_SLEW_MASK                         equ 00C0h

// Register: RC4I2C
#define RC4I2C RC4I2C
RC4I2C                                   equ 01EECh
// bitfield definitions
RC4I2C_TH_POSN                           equ 0000h
RC4I2C_TH_POSITION                       equ 0000h
RC4I2C_TH_SIZE                           equ 0002h
RC4I2C_TH_LENGTH                         equ 0002h
RC4I2C_TH_MASK                           equ 0003h
RC4I2C_PU_POSN                           equ 0004h
RC4I2C_PU_POSITION                       equ 0004h
RC4I2C_PU_SIZE                           equ 0002h
RC4I2C_PU_LENGTH                         equ 0002h
RC4I2C_PU_MASK                           equ 0030h
RC4I2C_SLEW_POSN                         equ 0006h
RC4I2C_SLEW_POSITION                     equ 0006h
RC4I2C_SLEW_SIZE                         equ 0002h
RC4I2C_SLEW_LENGTH                       equ 0002h
RC4I2C_SLEW_MASK                         equ 00C0h

// Register: RD0I2C
#define RD0I2C RD0I2C
RD0I2C                                   equ 01EEEh
// bitfield definitions
RD0I2C_TH_POSN                           equ 0000h
RD0I2C_TH_POSITION                       equ 0000h
RD0I2C_TH_SIZE                           equ 0002h
RD0I2C_TH_LENGTH                         equ 0002h
RD0I2C_TH_MASK                           equ 0003h
RD0I2C_PU_POSN                           equ 0004h
RD0I2C_PU_POSITION                       equ 0004h
RD0I2C_PU_SIZE                           equ 0002h
RD0I2C_PU_LENGTH                         equ 0002h
RD0I2C_PU_MASK                           equ 0030h
RD0I2C_SLEW_POSN                         equ 0006h
RD0I2C_SLEW_POSITION                     equ 0006h
RD0I2C_SLEW_SIZE                         equ 0002h
RD0I2C_SLEW_LENGTH                       equ 0002h
RD0I2C_SLEW_MASK                         equ 00C0h

// Register: RD1I2C
#define RD1I2C RD1I2C
RD1I2C                                   equ 01EEFh
// bitfield definitions
RD1I2C_TH_POSN                           equ 0000h
RD1I2C_TH_POSITION                       equ 0000h
RD1I2C_TH_SIZE                           equ 0002h
RD1I2C_TH_LENGTH                         equ 0002h
RD1I2C_TH_MASK                           equ 0003h
RD1I2C_PU_POSN                           equ 0004h
RD1I2C_PU_POSITION                       equ 0004h
RD1I2C_PU_SIZE                           equ 0002h
RD1I2C_PU_LENGTH                         equ 0002h
RD1I2C_PU_MASK                           equ 0030h
RD1I2C_SLEW_POSN                         equ 0006h
RD1I2C_SLEW_POSITION                     equ 0006h
RD1I2C_SLEW_SIZE                         equ 0002h
RD1I2C_SLEW_LENGTH                       equ 0002h
RD1I2C_SLEW_MASK                         equ 00C0h

// Register: UMTOAP
#define UMTOAP UMTOAP
UMTOAP                                   equ 01F0Ch
// bitfield definitions
UMTOAP_UMTOAP_POSN                       equ 0000h
UMTOAP_UMTOAP_POSITION                   equ 0000h
UMTOAP_UMTOAP_SIZE                       equ 0008h
UMTOAP_UMTOAP_LENGTH                     equ 0008h
UMTOAP_UMTOAP_MASK                       equ 00FFh

// Register: UMTOAL
#define UMTOAL UMTOAL
UMTOAL                                   equ 01F0Dh
// bitfield definitions
UMTOAL_UMTOAL_POSN                       equ 0000h
UMTOAL_UMTOAL_POSITION                   equ 0000h
UMTOAL_UMTOAL_SIZE                       equ 0008h
UMTOAL_UMTOAL_LENGTH                     equ 0008h
UMTOAL_UMTOAL_MASK                       equ 00FFh

// Register: UMTOAH
#define UMTOAH UMTOAH
UMTOAH                                   equ 01F0Eh
// bitfield definitions
UMTOAH_UMTOAH_POSN                       equ 0000h
UMTOAH_UMTOAH_POSITION                   equ 0000h
UMTOAH_UMTOAH_SIZE                       equ 0008h
UMTOAH_UMTOAH_LENGTH                     equ 0008h
UMTOAH_UMTOAH_MASK                       equ 00FFh

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 01FE4h
// bitfield definitions
STATUS_SHAD_STATUS_SHAD_POSN             equ 0000h
STATUS_SHAD_STATUS_SHAD_POSITION         equ 0000h
STATUS_SHAD_STATUS_SHAD_SIZE             equ 0003h
STATUS_SHAD_STATUS_SHAD_LENGTH           equ 0003h
STATUS_SHAD_STATUS_SHAD_MASK             equ 0007h
STATUS_SHAD_STATUS_SHAD0_POSN            equ 0000h
STATUS_SHAD_STATUS_SHAD0_POSITION        equ 0000h
STATUS_SHAD_STATUS_SHAD0_SIZE            equ 0001h
STATUS_SHAD_STATUS_SHAD0_LENGTH          equ 0001h
STATUS_SHAD_STATUS_SHAD0_MASK            equ 0001h
STATUS_SHAD_STATUS_SHAD1_POSN            equ 0001h
STATUS_SHAD_STATUS_SHAD1_POSITION        equ 0001h
STATUS_SHAD_STATUS_SHAD1_SIZE            equ 0001h
STATUS_SHAD_STATUS_SHAD1_LENGTH          equ 0001h
STATUS_SHAD_STATUS_SHAD1_MASK            equ 0002h
STATUS_SHAD_STATUS_SHAD2_POSN            equ 0002h
STATUS_SHAD_STATUS_SHAD2_POSITION        equ 0002h
STATUS_SHAD_STATUS_SHAD2_SIZE            equ 0001h
STATUS_SHAD_STATUS_SHAD2_LENGTH          equ 0001h
STATUS_SHAD_STATUS_SHAD2_MASK            equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 01FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 01FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0008h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0008h
BSR_SHAD_BSR_SHAD_MASK                   equ 00FFh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 01FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0008h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0008h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 00FFh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 01FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 01FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 01FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 01FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 01FEDh
// bitfield definitions
STKPTR_STKPTR0_POSN                      equ 0000h
STKPTR_STKPTR0_POSITION                  equ 0000h
STKPTR_STKPTR0_SIZE                      equ 0001h
STKPTR_STKPTR0_LENGTH                    equ 0001h
STKPTR_STKPTR0_MASK                      equ 0001h
STKPTR_STKPTR1_POSN                      equ 0001h
STKPTR_STKPTR1_POSITION                  equ 0001h
STKPTR_STKPTR1_SIZE                      equ 0001h
STKPTR_STKPTR1_LENGTH                    equ 0001h
STKPTR_STKPTR1_MASK                      equ 0002h
STKPTR_STKPTR2_POSN                      equ 0002h
STKPTR_STKPTR2_POSITION                  equ 0002h
STKPTR_STKPTR2_SIZE                      equ 0001h
STKPTR_STKPTR2_LENGTH                    equ 0001h
STKPTR_STKPTR2_MASK                      equ 0004h
STKPTR_STKPTR3_POSN                      equ 0003h
STKPTR_STKPTR3_POSITION                  equ 0003h
STKPTR_STKPTR3_SIZE                      equ 0001h
STKPTR_STKPTR3_LENGTH                    equ 0001h
STKPTR_STKPTR3_MASK                      equ 0008h
STKPTR_STKPTR4_POSN                      equ 0004h
STKPTR_STKPTR4_POSITION                  equ 0004h
STKPTR_STKPTR4_SIZE                      equ 0001h
STKPTR_STKPTR4_LENGTH                    equ 0001h
STKPTR_STKPTR4_MASK                      equ 0010h

